package practice2_2;
//2.2.4 Фигуры. Необходимо продумать структуру и организацию следующих геометрических фигур:
//1.	Круг.
//2.	Квадрат.
//3.	Прямоугольник.
//4.	Треугольник.
//Все фигуры должны быть встроены в иерархию. Корень иерархии должен определять общее для всех классов поведение и структуру.
// У каждой фигуры должна быть возможность рассчитать её площадь. Продумайте структуру всех необходимых классов и реализуйте её.
// Класс для квадрата из задачи 1.6.3 использовать не рекомендуется.
public abstract class Figure {
    abstract double getArea();
}
