package practice1_1;
/**
 * Класс для представления сущности "Человек"
 * <p>
 * Содержит имя человека и его рост, а также позволяет сформировать
 * текстовое представление формата "Имя, рост: значение"
 * </p>
 */
public class Human {
    /**
     * Имя человека
     */
    public String name;
    /**
     * Рост человека (см)
     */
    public int height;
    /**
     * Конструктор по умолчанию класса Human.
     */
    public Human(){}
    /**
     * Возвращает текстовое представление имени и роста человека
     *
     * @return строка вида "Имя, рост: значение"
     */
    @Override
    public String toString(){
        return (name + " рост: " + height);
    }
}
