package practice1_1;

//2.2.5 Точки. Необходимо разработать сущности, которые позволят создавать
// Точки координат с разными характеристиками. Например, мы можем иметь точки координат со следующими характеристиками:
//•	Одна, две или три координаты в пространстве (X,Y,Z: целые числа)
//•	Цвет точки (строка)
//•	Размер точки (число)
//Описанные характеристики не составляют исчерпывающий список. Точка должна быть реализована таким образом,
// чтобы появление новых характеристик не требовало внесение изменений в Точку. Характеристики могут составлять любые комбинации, например:
//•	Точка в координате 3, красного цвета
//•	Точка в координате {4,2,5} размером 20
//•	Точка в координате {7,7} желтого цвета, с красным ободком в форме котенка.
//С целью совместимости с последующими задачами, сохраните Двухмерную и Трёхмерную точки из задачи 2.1.5 без изменений.
public final class Point3D extends Point {
    private int z;
    public Point3D(int x, int y, int z){
        super(0, 0);
        coords = new int[3];
        coords[0] = x;
        coords[1] = y;
        coords[2] = z;
    }

    public void setZ(int z) {
        coords[2] = z;
    }

    public int getZ() {
        return coords[2];
    }

    public Point3D(Point point){
        super(0,0);
        coords = new int[3];
        for (int i = 0; i < point.coords.length && i < 3; i++){
            coords[i] = point.coords[i];
        }

    }
}
