package practice1_1;

/**
 * Класс представления времени в 24 формате
 *  <p>
 *  Время хранит общее количество секунд, прошедшее с начала суток (или некоторого отсчета).
 *  Предоставляет возможность форматирования времени в текстовый вид "ЧЧ:ММ:СС"
 *  </p>
 */
public class Time {
    /**
     * время в секундах
     */
    public int time;
    /**
     * Конструктор по умолчанию класса Time
     */
    public Time() {
    }

    /**
     * Преобразует время в секундах в текстовый формат "ЧЧ:ММ:СС".
     * <p>
     * Если общее количество секунд превышает 24 часа (86400 секунд),
     * то сутки обнуляются
     * </p>
     *
     * @return строка с временем в формате "ЧЧ:ММ:СС" (например, "2:46:40")
     */
    @Override
    public String toString(){
        int allTime = time % 86400;
        int hours = allTime / 3600;
        int minutes = (allTime % 3600) / 60;
        int seconds = allTime % 60;
        return (hours+ ":"+ minutes + ":" + seconds);
    }
}
