package practice1_1;
//2.2.5 Точки. Необходимо разработать сущности, которые позволят создавать Точки координат с разными характеристиками.
// Например, мы можем иметь точки координат со следующими характеристиками:
//•	Одна, две или три координаты в пространстве (X,Y,Z: целые числа)
//•	Цвет точки (строка)
//•	Размер точки (число)
//Описанные характеристики не составляют исчерпывающий список. Точка должна быть реализована таким образом,
// чтобы появление новых характеристик не требовало внесение изменений в Точку. Характеристики могут составлять любые комбинации, например:
//•	Точка в координате 3, красного цвета
//•	Точка в координате {4,2,5} размером 20
//•	Точка в координате {7,7} желтого цвета, с красным ободком в форме котенка.
//С целью совместимости с последующими задачами, сохраните Двухмерную и Трёхмерную точки из задачи 2.1.5 без изменений
public class ZAttributePoint extends Attribute {
    public ZAttributePoint(Integer value) {
        super("z", value);
    }

    @Override
    public Integer getValue() {
        return (Integer) super.getValue();
    }
}
