package practice1_5;

import java.sql.SQLOutput;

//1.5.2 Кот мяукает. Создайте сущность Кот, которая описывается следующим образом:
//•	Имеет Имя (строка)
//•	Для создания необходимо указать имя кота.
//•	Может быть приведен к текстовой форме вида: “кот: Имя”
//•	Может помяукать, что приводит к выводу на экран следующего текста: “Имя: мяу!”, вызвать мяуканье можно без параметров.
//•	Может помяукать N раз, что приводит к выводу на экран следующего текста: “Имя: мяу-мяу-…-мяу!”, где количество “мяу” равно N.
//Создайте кота по имени “Барсик”, и затем пусть он помяукает сначала один раз, а затем три раза.
public class Cat {
    private String name;
    public Cat(String name){
        this.name = name;
    }
    public void  getMeow(){
        getMeow(1);
    }
    public void getMeow(int n){
        String res = name + ":";
        if (n < 1){
            return;
        }
        for (int i = 0; i < n-1; i++){
            res += "мяу-";
        }
        res += "мяу!";
        System.out.println(res);
    }

}
