package practice1_5;
//1.5.1 Пистолет стреляет. Создайте сущность Пистолет, которая описывается следующим образом:
//•	Имеет Количество патронов (целое число)
//•	Может быть создан с указанием начального количества патронов
//•	Может быть создан без указания начального количества патронов, в этом случае он изначально заряжен пятью патронами.
//•	Может Стрелять, что приводит к выводу на экран текста “Бах!” в том случае,
// если количество патронов больше нуля, иначе делает “Клац!”. После каждого выстрела (когда вывелся “Бах!”)
// количество патронов уменьшается на один.
//Создайте пистолет с тремя патронами и выстрелите из него пять раз.

public class Gun extends Weapon{
    static private final int DEFAULT_COUNT = 5;
    private int maxAmmo;

    public Gun(){
        this(DEFAULT_COUNT);
    }
    public Gun(int ammo, int maxAmmo) {
        super(ammo > 0 ? ammo : DEFAULT_COUNT);
        if (maxAmmo < 0){
            maxAmmo = DEFAULT_COUNT;
        }
        this.maxAmmo = maxAmmo;
        if (ammo < 0){
            ammo = 0;
        }
        else if (ammo > maxAmmo){
            ammo = maxAmmo;
        }
    }
    public Gun (int maxAmmo) {
        this(maxAmmo, maxAmmo);
    }

    public int reload(int newAmmo){
        if (newAmmo < 0){
            throw new IllegalArgumentException("Передано отрицательное число патрон!");
        }

        int total = ammo() + newAmmo;
        if (total > maxAmmo){
            load(maxAmmo);
            return total - maxAmmo;
        }
        load(total);
        return 0;
    }

    public int unload(){
        int saved = ammo();
        load(0);
        return saved;

    }
    public int getMaxAmmo(){
        return maxAmmo;
    }


    public String shoot(){
        if (ammo() > 0){
            getAmmo();
            return "Бах!";
        }
        return "Клац!";
    }

}

//1.6.5 Перезарядка Пистолета. Измените сущность Пистолет из задачи 1.5.1. Модификация предполагает внесение следующих дополнительных требований:
//•	Имеет максимальное количество патронов. Максимальное количество устанавливается во время создания пистолета и не может быть изменено позднее. У пистолета можно узнать, какое максимальное количество он вмещает.
//•	Может быть перезаряжен. Для перезарядки необходимо передать пистолету число, которое будет означать количество заряжаемых патронов. Если передано отрицательное число, необходимо выбросить ошибку, объясняющую, что отрицательного числа патронов быть не может. Если передано слишком большое число патронов – необходимо лишние вернуть.
//•	Может быть разряжен. Это приводит к обнулению патронов в пистолете и возврате нужного числа пользователю.
//•	Можно узнать сколько сейчас заряжено патронов.
//•	Можно узнать заряжен он или разряжен.

