package practice1_5;

import practice1_1.Point;
import practice1_2.PolyLine;

//1.5.8 Квадрат. Создайте сущность Квадрат. Квадрат описывается следующими характеристиками:
//•	Имеет Точку (из задачи 1.4.1) отмечающую левый верхний угол
//•	Имеет длину стороны.
//•	Создается путем указания точки левого верхнего угла и размера стороны
//•	Создается путем указания координаты x и y левого верхнего угла и размера стороны
//•	Может быть приведен к строке вида “Квадрат в точке T со стороной N”, где N – длина стороны, а T – результат приведения к строке верхнего левого угла
//•	Может возвращать новую Ломаную (из задачи 1.5.7), точки которой соответствуют точкам углов текущего квадрата.
//Необходимо выполнить следующие задачи:
//1.	Создайте Квадрат в точке {5;3} со стороной 23
//2.	Присвойте в ссылку типа Ломаная результат вызова метода получения Ломаной у ранее созданного квадрата
//3.	Выведите на экран общую длину полученной Ломаной
//4.	Сдвиньте последнюю Точку Ломаной в позицию {15,25}
//5.	Снова выведите на экран длину Ломаной
public class Square {
    Point point;
    private int len;

    public Square(Point point, int len) {
        this.point = point;
        this.len = len;
    }
    public Square(int x, int y, int len) {
        this(new Point(x, y), len);
    }

    public PolyLine getPolyLine(){
        int x = point.getX();
        int y = point.getY();
        return new PolyLine(new Point[]{
                new Point(x, y),
                new Point(x + len, y),
                new Point(x + len, y - len),
                new Point(x, y-len),
                new Point(x,y)
        });
    }
    @Override
    public String toString() {
        return "Квадрат в точке " + point + " со стороной " + len;
    }
}
